# ViewSolarstudyShadowsIntensityText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyShadowsIntensityText Property
ParameterTypeId Class See Also
---
"Shadows intensity text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyShadowsIntensityText { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyShadowsIntensityText As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyShadowsIntensityText {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace